Revit 2026 API

# ElectricalSystemSetCircuitPath Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCircuitPath(
	IList<XYZ> nodes
)
```
```vb
Public Sub SetCircuitPath (
	nodes As IList(Of XYZ)
)
```
```cpp
public:
void SetCircuitPath(
	IList<XYZ^>^ nodes
)
```
```fsharp
member SetCircuitPath :
        nodes : IList<XYZ> -> unit
```

#### Parameters

nodes IListXYZ

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace